<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ExamCountdownSettingsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('exam_countdown_settings')->delete();
        
        \DB::table('exam_countdown_settings')->insert(array (
            0 => 
            array (
                'id' => 1,
                'title' => 'روز شمار کنکور ۱۴۰۵',
                'subtitle' => 'روز شمار کنکور ۱۴۰۵ ریاضی، تجربی، انسانی را در این صفحه مشاهده می‌کنید.',
                'card_title' => 'کنکور 1405',
                'start_date' => '2026-04-12',
                'end_date' => '2026-07-03',
                'description' => '<p>با وارد کردن این اطلاعات در درصدگیر آنلاین، می&zwnj;توانید دو نوع درصد را مشاهده کنید:</p>

<ul>
<li>
<p>درصد خام: این درصد بدون در نظر گرفتن نمره منفی محاسبه می&zwnj;شود. فرمول آن به این صورت است:</p>

<p><img alt="فرمول محاسبه درصد خام" src="https://biomaze.ir/_nuxt/img/level-calc.461e23c.png" title="فرمول محاسبه درصد خام" /></p>
</li>
<li>
<p>درصد نهایی: این درصد با در نظر گرفتن نمره منفی محاسبه می&zwnj;شود. فرمول آن به این صورت است:</p>

<p><img alt="فرمول محاسبه درصد نهایی" src="https://biomaze.ir/_nuxt/img/level-calc-formula.4f08e34.png" title="فرمول محاسبه درصد نهایی" /></p>
</li>
</ul>

<h2>نحوه کار با نرم افزار محاسبه درصد تست</h2>

<p>کار کردن با این نرم افزار ساده است. کافی است بعد از پاسخ دادن به آزمون تعداد سوالات صحیح، غلط و نزده را وارد کنید و درصد پاسخگویی خودتان را مشاهده کنید.</p>

<h2>چرا باید درصد پاسخگویی خود را محاسبه کنیم؟</h2>

<p>درصد پاسخگویی نشان&zwnj;دهنده&zwnj;ی تعداد پاسخ&zwnj;های درست شما در مجموع سوالات است. با محاسبه درصد پاسخگویی، می&zwnj;توانید<strong>&nbsp;میزان تسلط خودتان را در آن مبحث بسنجید.&nbsp;</strong>می&zwnj;توانید نقاط قوت و ضعف خودتان را شناسایی کنید. با کمک این موضوع برنامه متناسب با میزان تسلط خودتان طراحی می&zwnj;کنید تا آن مباحث را بیشتر تمرین و تکرار کنید.</p>

<h2>هر تست غلط چند تست صحیح را کم می&zwnj;کند؟</h2>

<p>هر ۳ تست غلط یک پاسخ صحیح را از بین می&zwnj;برد. با کمک درصد گیر آنلاین ماز می&zwnj;توانید متوجه شوید اگر تعداد سوالات غلط خودتان را کاهش دهید، درصد پاسخگویی شما چقدر افزایش پیدا می&zwnj;کند.</p>

<p>درحل آزمون&zwnj;ها باید تلاش خودتان را بکار بگیرید تا حد ممکن از پاسخ شانسی و غلط به تست&zwnj;ها جلوگیری کنید.<strong>&nbsp;اگر تفاوت درصدخام و درصد نهایی شما زیاد است،&nbsp;</strong>این بدین معنی است که نمره منفی تاثیر زیادی روی وضعیت پاسخگویی شما داشته است.</p>

<h2>اهمیت کاهش تعداد سوالات غلط در آزمون</h2>

<p>با کاهش سوالات غلط درصد بالاتری را در آزمون&zwnj;ها و در نهایت در کنکور کسب می&zwnj;کنید. از آزمون دادن و دیدن نتیجه نا امید نشوید چرا که تست&zwnj;زدن و آزمون دادن یک راه یادگیری است. پس بهتر است این راه را مثل سایر راه&zwnj;ها به بهترین شکل انجام دهید و این موضوع را فراموش نکنید<strong>&nbsp;تا راه نروید ترستان از راه رفتن نمی&zwnj;ریزد.&nbsp;</strong>آزمون آزمایشی دادن نیز مانند راه رفتن است که به شما کمک می&zwnj;کند ترستان از کنکور بریزد و فرصت جبران نقاط ضعف خودتان را داشته باشید.</p>

<h2>اما چگونه می&zwnj;توانیم تست&zwnj;های غلط خودمان را کاهش دهیم؟</h2>

<ul>
<li>
<p>علت غلط زدن تست را بیابید.(مطالعه کم- عدم تسلط- تمرین کم و..)</p>
</li>
<li>
<p>.با توجه به علت راهکار مناسب آن را کنید. مثلاً: اگر تمرین شما کم بوده بهتر است قبل از آزمون تست&zwnj;های بیشتری کار کنید.</p>
</li>
<li>
<p>تست&zwnj;های بیشتری حل کنید. از آزمون دادن نترسید. با حل تست&zwnj;های بیشتر به تسلط بهتری می&zwnj;رسید. در این مسیر می&zwnj;توانید<a href="https://biomaze.ir/shop" target="_blank">&nbsp;از آزمون&zwnj;های آنلاین ماز&nbsp;</a>که پیشنهاد رتبه&zwnj;برترها بوده است را برای تسلط بیشتر بر مباحث حل کنید.</p>
</li>
<li>
<p>آزمون&zwnj;ها و تست&zwnj;ها را بصورت کامل تحلیل کنید. هیچ آزمونی را بدون تحلیل رها نکنید.</p>
</li>
<li>
<p>از پاسخ به سوالاتی که شک دارید و یا پاسخ شانسی به تست&zwnj;ها خودداری کنید.</p>
</li>
</ul>

<p>با عمل به همین ۵ مورد ذکر شده می&zwnj;توانید درصد آزمون&zwnj;ها خودتان را افزایش دهید و خودتان را به رشته دلخواهتان نزدیک کنید.</p>

<h2>هر آزمون را چند درصد بزنیم خوب است؟</h2>

<ul>
<li>
<p>اگر<strong>&nbsp;سطح آزمون ساده&nbsp;</strong>است، درصد پاسخگویی شما بهتر است بالای<strong>&nbsp;۷۵&nbsp;</strong>درصد باشد.</p>
</li>
<li>
<p>اگر<strong>&nbsp;سطح آزمون متوسط&nbsp;</strong>است، درصد پاسخگویی<strong>&nbsp;۶۵&nbsp;</strong>درصد به بالا خوب است.</p>
</li>
<li>
<p>اگر<strong>&nbsp;سطح آزمون سخت&nbsp;</strong>و چالشی است، درصد پاسخگویی<strong>&nbsp;۵۰&nbsp;</strong>درصد به بالا حالت مطلوب است.</p>
</li>
<li>
<p><strong>اگر درصد پاسخگویی شما در سطح آزمون ساده پایین تر از این مقدار است&nbsp;</strong>یعنی شما مبحث درسی را به خوبی یاد نگرفته&zwnj;اید و نیاز است دوباره آن را مطالعه کنید و نقاط ضعف خودتان را بیابید. اگر متوجه مفهوم اصلی موضوع نمی&zwnj;شوید و در درک آن مشکل دارید بهتر است از<a href="https://biomaze.ir/shop" target="_blank">&nbsp;کلاس&zwnj;های آنلاین اساتید ماز&nbsp;</a>برای رفع ایرادات خودتان استفاده کنید. اگر درصد پاسخگویی شما در آزمون با سطح متوسط و سخت پایین&zwnj;تر از حد انتظار است. لازم است تا تست&zwnj;های بیشتری را حل کنید. در نظر داشته باشید با حل تست&zwnj;های بیشتر نقاط ضعف خودتان را پیدا می&zwnj;کنید و تسلط بالاتری می&zwnj;رسید.</p>
</li>
<li>
<p>اگر درصد پاسخگویی شما در آزمون با سطح متوسط و سخت پایین&zwnj;تر از حد انتظار است. لازم است تا تست&zwnj;های بیشتری را حل کنید. در نظر داشته باشید با حل تست&zwnj;های بیشتر نقاط ضعف خودتان را پیدا می&zwnj;کنید و تسلط بالاتری می&zwnj;رسید.</p>
</li>
</ul>

<h2>بهترین منبع برای افزایش درصد پاسخگویی به دروس چیست؟</h2>

<p>برای اینکه در آزمون&zwnj;ها درصد بهتری را کسب کنید به حل تست&zwnj;های کتاب کمک آموزشی خود بسنده نکنید. لازم است قبل از آزمون سوالات سال&zwnj;های قبل ماز را حل کنید. با حل سوالات سال&zwnj;های قبل شما متوجه مطالب مهم در این بودجه بندی می&zwnj;شوید و قبل از آزمون فرصت رفع ایرادات خودتان را دارید.</p>

<p>برای دسترسی به سوالات سال&zwnj;های قبل ماز کافیست<a href="https://digimaze.org/" target="_blank">&nbsp;اپلیکیشن دیجی ماز&nbsp;</a>را دانلود کنید تا بتوانید به سوالات آزمون&zwnj;های سال&zwnj;های قبل ماز دسترسی داشته باشید.</p>
',
                'created_at' => '2026-04-12 19:06:06',
                'updated_at' => '2026-04-12 19:43:56',
            ),
        ));
        
        
    }
}