<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ProductsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('products')->delete();
        
        \DB::table('products')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => 'سکوی پرتاب',
                'title' => 'حرکتی سریع و تازه در فضا',
                'tag' => 'کنکور-ریاضی',
                'type' => 'weekly',
                'duration_days' => 30,
                'has_supporter' => 0,
                'has_advisor' => 0,
                'course_time' => '30 روز',
                'meeting_time' => '25 جلسه',
                'price' => 499000,
                'description' => '<p><span style="color:#ffffff"><span style="background-color:#3498db">این پکیج برای آن دسته از افرادی است که به دنبال یک&nbsp;شروع هوشمندانه&nbsp;هستند. فرصتی برای آشنایی با خدمات ما و تست متد SDFR تا از کیفیت و اثربخشی آن اطمینان حاصل کنند.</span></span></p>
',
                'category_id' => 1,
                'p_code' => 'sdfr-75626191',
                'deleted_at' => '2025-08-12 14:48:30',
                'created_at' => '2025-03-27 21:49:41',
                'updated_at' => '2025-08-12 14:48:30',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => 'توسعه و گستردگی در یادگیری',
                'title' => 'توسعه و گستردگی در یادگیری',
                'tag' => 'مشاوره تحصیلی',
                'type' => 'weekly',
                'duration_days' => 30,
                'has_supporter' => 0,
                'has_advisor' => 0,
                'course_time' => 'پایان سال تحصیلی',
                'meeting_time' => 'هفته ای یک جلسه',
                'price' => 15000000,
                'description' => '<p>با این پکیج وارد مرحله&zwnj;ای پیشرفته&zwnj;تر می&zwnj;شوید. مشاوره تخصصی با متد انحصاری SDFR،<span style="color:#c0392b">&nbsp;دوره&zwnj;های روانشناسی و برنامه&zwnj;های ورزشی حرفه&zwnj;ای،</span> شما را در مسیری قرار می&zwnj;دهد که نه&zwnj;تنها در تحصیل، بلکه در جنبه&zwnj;های مختلف زندگی نیز پیشرفت کنید.</p>

<p>&nbsp;</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-49785',
                'deleted_at' => '2025-08-12 14:50:01',
                'created_at' => '2025-03-27 23:27:16',
                'updated_at' => '2025-08-12 14:50:01',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => 'کوانتوم',
                'title' => 'دستیابی به مفاهیم عمیق ',
                'tag' => 'دوازدهم',
                'type' => 'weekly',
                'duration_days' => 30,
                'has_supporter' => 0,
                'has_advisor' => 0,
                'course_time' => 'پایان سال تحصیلی',
                'meeting_time' => 'هفته ای یک جلسه',
                'price' => 25000000,
                'description' => '<p>این پکیج برای افرادی طراحی شده که به دنبال یک تجربه لوکس و استثنایی هستند. در &#39;کوانتوم&#39;، شما&nbsp;به طور مستقیم با <span style="color:#c0392b">بنیان&zwnj;گذاران SDFR&nbsp;</span>در ارتباط خواهید بود و از<span style="color:#c0392b"> مشاوره&zwnj;های فوق&zwnj;تخصصی</span> و خدماتی بی&zwnj;نظیر بهره&zwnj;مند خواهید شد که تضمین&zwnj;کننده موفقیت شماست.</p>

<p>&nbsp;</p>
',
                'category_id' => 2,
                'p_code' => 'SDFR-43352',
                'deleted_at' => '2025-08-12 14:50:12',
                'created_at' => '2025-03-27 23:30:09',
                'updated_at' => '2025-08-12 14:50:12',
            ),
            3 => 
            array (
                'id' => 4,
                'name' => 'دوره کاوشگر',
                'title' => 'در جستجوی مسیر سفر به خورشید ',
                'tag' => 'همه پایه ها',
                'type' => 'weekly',
                'duration_days' => 8,
                'has_supporter' => 1,
                'has_advisor' => 1,
                'course_time' => 'هفت روز',
                'meeting_time' => 'یک جلسه',
                'price' => 180000,
                'description' => '<p>در این دوره دانش آموزان می&zwnj;توانند با پرداخت مبلغ 180 هزار تومان، ۱ هفته به صورت آزمایشی از کلیه خدمات پنل استفاده کنند.<br />
همچنین در ابتدای هفته با برنامه ریزی درسی مشاورین مجرب SDFR و پیگیری و پشتیبانی آنها از کیفیت خدمات این سیستم می&zwnj;توانند بهره مند شوند.<br />
&nbsp;</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-33270',
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:54:18',
                'updated_at' => '2025-08-17 18:11:39',
            ),
            4 => 
            array (
                'id' => 5,
                'name' => 'دوره ویگا',
                'title' => 'تجربه تنهایی سفر کردن به سمت خورشید',
                'tag' => 'کنکور',
                'type' => 'monthly',
                'duration_days' => 31,
                'has_supporter' => 1,
                'has_advisor' => 0,
                'course_time' => 'یک ماه',
                'meeting_time' => 'ندارد',
                'price' => 448000,
                'description' => '<p>این دوره مخصوص دانش آموزان مستقل برنامه ریزی شده که نیازی به مشاوره تحصیلی ندارند ولی درنظر دارند برای افزایش راندمان مطالعه و پیمودن مسیر صحیح مطالعه از شخص متخصص کمک بگیرند تا با راهنمایی ایشان بتوانند به خروجی بسیار مفیدی از مطالعه خود دست یابند.&nbsp;<br />
دانش آموزان با انتخاب این دوره تحت نظر پشتیبان تحصیلی به صورت کاملا اختصاصی می توانند از خدمات این دوره بهره مند شوند.</p>

<p><span style="color:#27ae60">&nbsp;خدمات دوره:</span><br />
۱. بررسی کلی وضعیت تحصیلی دانش آموز و معرفی بهترین کتاب های کمک درسی متناسب با سطح دانش آموز.<br />
۲. بررسی و ثبت روزانه روند مطالعه دانش آموز در سیستم SDFR و ارائه کارنامه ماهانه به دانش آموز که در آن نقاط ضعف و قوت و ضریب رشد یک ماه تحصیل مشخص شده است.<br />
۳. بررسی روز به روز گزارشات دانش آموز و ارائه راهکار جهت اصلاح ایرادات مطالعه: درصورتی که روند مطالعه دانش آموز مشکلی داشته باشد یا مسیر اشتباهی را پیش گرفته باشد، همان روز پشتیبان با ارسال تیکت دانش آموز را مطلع میکند و فرایند اصلاح مشکل برای ایشان ارسال می شود.<br />
۴. برگزاری یک آزمون مبحثی در هفته و آموزش و بررسی تحلیل آزمون توسط پشتیبان.<br />
۵. برقراری یک بار تماس تلفنی در هفته با دانش آموز و یکبار تماس با اولیا در پایان ماه.<br />
۶. قابلیت استفاده از ابزار های حرفه ای SDFR که شامل: تکنیک پومودورو و&hellip; می&zwnj;باشد.</p>

<p>موارد مالی دوره:<br />
مبلغ شهریه دوره مستقل به صورت ماهانه پرداخت میشود و تماما اقساطی می باشد<br />
ماهانه مبلغ ۴۵۰ هزار تومان<br />
مبلغ نقد اولیه ۴۵۰تومان<br />
اقساط ماهانه ۴۵۰ت</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-71423',
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:56:40',
                'updated_at' => '2025-08-17 18:17:01',
            ),
            5 => 
            array (
                'id' => 6,
                'name' => 'دوره نوا',
                'title' => 'تجربه سفر به خورشید با مشورت و راهنما',
                'tag' => 'کنکور',
                'type' => 'weekly',
                'duration_days' => 30,
                'has_supporter' => 1,
                'has_advisor' => 1,
                'course_time' => 'یک سال',
                'meeting_time' => 'جلسات متعدد',
                'price' => 9000000,
                'description' => '<p>این دوره مخصوص دانش آموزان مستقل برنامه ریزی شده که نیازی به مشاوره تحصیلی ندارند ولی درنظر دارند برای افزایش راندمان مطالعه و پیمودن مسیر صحیح مطالعه از شخص متخصص کمک بگیرند تا با راهنمایی ایشان بتوانند به خروجی بسیار مفیدی از مطالعه خود دست یابند.&nbsp;<br />
دانش آموزان با انتخاب این دوره تحت نظر پشتیبان تحصیلی به صورت کاملا اختصاصی می توانند از خدمات این دوره بهره مند شوند.</p>

<p><span style="color:#27ae60">&nbsp;خدمات دوره:</span><br />
۱. بررسی کلی وضعیت تحصیلی دانش آموز و معرفی بهترین کتاب های کمک درسی متناسب با سطح دانش آموز.<br />
۲. بررسی و ثبت روزانه روند مطالعه دانش آموز در سیستم SDFR و ارائه کارنامه ماهانه به دانش آموز که در آن نقاط ضعف و قوت و ضریب رشد یک ماه تحصیل مشخص شده است.<br />
۳. بررسی روز به روز گزارشات دانش آموز و ارائه راهکار جهت اصلاح ایرادات مطالعه: درصورتی که روند مطالعه دانش آموز مشکلی داشته باشد یا مسیر اشتباهی را پیش گرفته باشد، همان روز پشتیبان با ارسال تیکت دانش آموز را مطلع میکند و فرایند اصلاح مشکل برای ایشان ارسال می شود.<br />
۴. برگزاری یک آزمون مبحثی در هفته و آموزش و بررسی تحلیل آزمون توسط پشتیبان.<br />
۵. برقراری یک بار تماس تلفنی در هفته با دانش آموز و یکبار تماس با اولیا در پایان ماه.<br />
۶. قابلیت استفاده از ابزار های حرفه ای SDFR که شامل: تکنیک پومودورو و&hellip; می&zwnj;باشد.</p>

<p>موارد مالی دوره:<br />
مبلغ شهریه دوره مستقل به صورت ماهانه پرداخت میشود و تماما اقساطی می باشد<br />
ماهانه مبلغ ۴۵۰ هزار تومان<br />
مبلغ نقد اولیه ۴۵۰تومان<br />
اقساط ماهانه ۴۵۰ت</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-9915',
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:58:44',
                'updated_at' => '2025-08-17 18:29:57',
            ),
            6 => 
            array (
                'id' => 7,
            'name' => 'دوره نبولا (حضوری)',
                'title' => 'فرود موفقیت آمیز در خورشید',
                'tag' => 'کنکور',
                'type' => 'yearly_offline',
                'duration_days' => 366,
                'has_supporter' => 1,
                'has_advisor' => 1,
                'course_time' => 'سالیانه',
                'meeting_time' => 'جلسات متعدد',
                'price' => 25000000,
                'description' => '<p>این دوره به ۲صورت برگزار می&zwnj;شود:<br />
دوره حضوری VIP+<br />
دوره غیرحضوری VIP+</p>

<p>شرح دوره:<br />
این ۲ دوره مخصوص دانش آموزانی درنظر گرفته شده که قصد رسیدن به اهداف دور از انتظار خود را دارند.<br />
درمورد دوره ای صحبت میکنیم که صفر و صد برنامه ریزی شده. این یعنی یا دانش آموز عضو این دوره نمی&zwnj;شود یا اگر عضو این دوره شد، هیچ راهی جز قبولی در رشته و دانشگاه دلخواه نداشته باشد!<br />
این دوره به دلیل ارائه خدمات فوق ویژه، فقط تعداد محدود دانش آموز (در یک بازه زمانی خاص از سال تحصیلی) پذیرش دارد.<br />
دانش آموزانی که قصد دارند با انتخاب این دوره از خود یک حرفه ای به تمام معنا بسازند، در ابتدا دعوت به جلسه مصاحبه خواهند شد. درصورتی که دانش آموز امتیاز لازم را در مصاحبه کسب کند می تواند از خدمات دوره VIP+ بهره مند شود.<br />
در صورتی که امتیاز لازم در جلسه مصاحبه کسب نشد، دانش آموز می تواند با استفاده از دوره آزمایشی ظرف مدت ۱ هفته با کمک مشاورین مجرب SDFR خودش را به سطح امتیاز لازم برساند.</p>

<p>روش عضویت در این دوره:<br />
ابتدا حضوری یا غیرحضوری بودن دوره را مشخص کنید.<br />
بر روی درخواست جلسه مصاحبه کلیک می&zwnj;کنید.<br />
پس از پر کردن اطلاعات شخصی منتظر تماس از تیم SDFR باشید.<br />
تیم SDFR با شما تماس برقرار میکنند و بر اساس انتخاب حضوری یا غیرحضوری شما، زمان و چگونگی برگزاری جلسه مصاحبه را خدمتتان عرض میکنند.<br />
ادامه فرایند عضویت در انتهای جلسه مصاحبه توسط مهندس اتقیایی به شما توضیح داده خواهد شد.</p>

<p><span style="color:#27ae60">خدمات این دوره شامل</span>:<br />
۱. برگزاری جلسات مشاوره هفتگی توسط شخص مهندس اتقیایی به صورت حضوری و غیرحضوری (تماس تصویری در اتاق مجازی مشاوره) .<br />
&nbsp;۲. برگزاری کارگاه مشاوره گروهی هر دوماه یکبار با موضوعات آموزشی و انگیزشی توسط مبدع متد SDFR (مهندس اتقیایی).<br />
۳. برگزاری ۱جلسه تراپی نوجوان در هرماه (درصورت نیاز و اختیاری).<br />
۴. بررسی و تحلیل کامل گزارشات ارسالی دانش آموز توسط شخص مهندس اتقیایی.<br />
۵. ارائه برنامه مطالعاتی شخصی سازی شده به طوری که به روز ترین متد برنامه ریزی تحصیلی و رعایت اصول ۵گانه یادگیری در آن لحاظ می شود تا دانش آموز بتواند موارد درسی را از حافظه کوتاه مدت به حافظه بلند مدت منتقل کند.<br />
۶. علاوه بر جلسات مشاوره که به صورت توافقی در زمان مشخص از پیش تعیین می&zwnj;شود، دانش آموزان میتوانند در صورت بروز هرگونه مشکل آموزشی و احساس عدم پیشرفت در برنامه، به واسطه ی تماس تلفنی بدون محدودیت زمانی با شخص مهندس اتقیایی ارتباط برقرار کنند و راهنمایی لازم را کسب کنند.<br />
۷. بررسی کلی وضعیت تحصیلی دانش آموز و معرفی بهترین کتاب های کمک درسی متناسب با سطح دانش آموز.<br />
۸. بررسی و ثبت روند روزانه مطالعه دانش آموز در سیستم SDFR توسط شخص مهندس اتقیایی و ارائه کارنامه ماهانه به دانش آموز که در آن نقاط ضعف و قوت و ضریب رشد یک ماه تحصیل مشخص شده است.<br />
۹. بررسی روز به روز گزارشات دانش آموز توسط شخص مهندس اتقیایی و ارائه راهکار جهت اصلاح ایرادات مطالعه: درصورتی که روند مطالعه دانش آموز مشکلی داشته باشد یا مسیر اشتباهی را پیش گرفته باشد، همان روز ایشان با ارسال تیکت دانش آموز را مطلع میکند و فرایند اصلاح مشکل برای ایشان ارسال می شود.<br />
۱۰. برگزاری یک آزمون مبحثی در هفته و آموزش و بررسی تحلیل آزمون توسط پشتیبان ارشد مجموعه.<br />
۱۱. برقراری یک بار تماس تلفنی در هفته با دانش آموز و یکبار تماس تلفنی با اولیا در پایان ماه.<br />
۱۲. قابلیت استفاده از ابزار های حرفه ای SDFR در پنل دانش آموز که شامل: تکنیک پومودورو و&hellip; می&zwnj;باشد.</p>

<p>موارد مالی دوره:<br />
مبلغ کامل دوره حضوری ۲۵ میلیون تومان می&zwnj;باشد.<br />
مبلغ کامل دوره غیرحضوری ۲۰ میلیون تومان می&zwnj;باشد.<br />
درصورت پرداخت نقدی، ۱۰٪ از مبلغ کل شهریه کسر خواهد شد.<br />
درصورتی که روش اقساطی مد نظر باشد، ۳۰٪ از مبلغ کل دوره به عنوان پیش پرداخت در ابتدای شروع خدمات تسویه می&zwnj;شود و مابقی مبلغ به روش سیستمی و خودکار در بخش (اقساط شهریه پنل دانش آموز)، به صورت ماهانه تقسیط می&zwnj;شود.</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-79763',
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 15:01:00',
                'updated_at' => '2025-08-17 18:32:27',
            ),
            7 => 
            array (
                'id' => 8,
            'name' => 'دوره نبولا (آنلاین)',
                'title' => ' فرود موفقیت آمیز در خورشید',
                'tag' => 'کنکور',
                'type' => 'yearly_online',
                'duration_days' => 366,
                'has_supporter' => 1,
                'has_advisor' => 1,
                'course_time' => 'سالیانه',
                'meeting_time' => 'جلسات متعدد',
                'price' => 20000000,
                'description' => '<p>این دوره به ۲صورت برگزار می&zwnj;شود:<br />
دوره حضوری VIP+<br />
دوره غیرحضوری VIP+</p>

<p><span style="color:#27ae60">شرح دوره</span>:<br />
این ۲ دوره مخصوص دانش آموزانی درنظر گرفته شده که قصد رسیدن به اهداف دور از انتظار خود را دارند.<br />
درمورد دوره ای صحبت میکنیم که صفر و صد برنامه ریزی شده. این یعنی یا دانش آموز عضو این دوره نمی&zwnj;شود یا اگر عضو این دوره شد، هیچ راهی جز قبولی در رشته و دانشگاه دلخواه نداشته باشد!<br />
این دوره به دلیل ارائه خدمات فوق ویژه، فقط تعداد محدود دانش آموز (در یک بازه زمانی خاص از سال تحصیلی) پذیرش دارد.<br />
دانش آموزانی که قصد دارند با انتخاب این دوره از خود یک حرفه ای به تمام معنا بسازند، در ابتدا دعوت به جلسه مصاحبه خواهند شد. درصورتی که دانش آموز امتیاز لازم را در مصاحبه کسب کند می تواند از خدمات دوره VIP+ بهره مند شود.<br />
در صورتی که امتیاز لازم در جلسه مصاحبه کسب نشد، دانش آموز می تواند با استفاده از دوره آزمایشی ظرف مدت ۱ هفته با کمک مشاورین مجرب SDFR خودش را به سطح امتیاز لازم برساند.</p>

<p><span style="color:#27ae60">روش عضویت در این دوره</span>:<br />
ابتدا حضوری یا غیرحضوری بودن دوره را مشخص کنید.<br />
بر روی درخواست جلسه مصاحبه کلیک می&zwnj;کنید.<br />
پس از پر کردن اطلاعات شخصی منتظر تماس از تیم SDFR باشید.<br />
تیم SDFR با شما تماس برقرار میکنند و بر اساس انتخاب حضوری یا غیرحضوری شما، زمان و چگونگی برگزاری جلسه مصاحبه را خدمتتان عرض میکنند.<br />
ادامه فرایند عضویت در انتهای جلسه مصاحبه توسط مهندس اتقیایی به شما توضیح داده خواهد شد.</p>

<p><span style="color:#27ae60">خدمات این دوره شامل</span>:<br />
۱. برگزاری جلسات مشاوره هفتگی توسط شخص مهندس اتقیایی به صورت حضوری و غیرحضوری (تماس تصویری در اتاق مجازی مشاوره) .<br />
&nbsp;۲. برگزاری کارگاه مشاوره گروهی هر دوماه یکبار با موضوعات آموزشی و انگیزشی توسط مبدع متد SDFR (مهندس اتقیایی).<br />
۳. برگزاری ۱جلسه تراپی نوجوان در هرماه (درصورت نیاز و اختیاری).<br />
۴. بررسی و تحلیل کامل گزارشات ارسالی دانش آموز توسط شخص مهندس اتقیایی.<br />
۵. ارائه برنامه مطالعاتی شخصی سازی شده به طوری که به روز ترین متد برنامه ریزی تحصیلی و رعایت اصول ۵گانه یادگیری در آن لحاظ می شود تا دانش آموز بتواند موارد درسی را از حافظه کوتاه مدت به حافظه بلند مدت منتقل کند.<br />
۶. علاوه بر جلسات مشاوره که به صورت توافقی در زمان مشخص از پیش تعیین می&zwnj;شود، دانش آموزان میتوانند در صورت بروز هرگونه مشکل آموزشی و احساس عدم پیشرفت در برنامه، به واسطه ی تماس تلفنی بدون محدودیت زمانی با شخص مهندس اتقیایی ارتباط برقرار کنند و راهنمایی لازم را کسب کنند.<br />
۷. بررسی کلی وضعیت تحصیلی دانش آموز و معرفی بهترین کتاب های کمک درسی متناسب با سطح دانش آموز.<br />
۸. بررسی و ثبت روند روزانه مطالعه دانش آموز در سیستم SDFR توسط شخص مهندس اتقیایی و ارائه کارنامه ماهانه به دانش آموز که در آن نقاط ضعف و قوت و ضریب رشد یک ماه تحصیل مشخص شده است.<br />
۹. بررسی روز به روز گزارشات دانش آموز توسط شخص مهندس اتقیایی و ارائه راهکار جهت اصلاح ایرادات مطالعه: درصورتی که روند مطالعه دانش آموز مشکلی داشته باشد یا مسیر اشتباهی را پیش گرفته باشد، همان روز ایشان با ارسال تیکت دانش آموز را مطلع میکند و فرایند اصلاح مشکل برای ایشان ارسال می شود.<br />
۱۰. برگزاری یک آزمون مبحثی در هفته و آموزش و بررسی تحلیل آزمون توسط پشتیبان ارشد مجموعه.<br />
۱۱. برقراری یک بار تماس تلفنی در هفته با دانش آموز و یکبار تماس تلفنی با اولیا در پایان ماه.<br />
۱۲. قابلیت استفاده از ابزار های حرفه ای SDFR در پنل دانش آموز که شامل: تکنیک پومودورو و&hellip; می&zwnj;باشد.</p>

<p>موارد مالی دوره:<br />
مبلغ کامل دوره حضوری ۲۵ میلیون تومان می&zwnj;باشد.<br />
مبلغ کامل دوره غیرحضوری ۲۰ میلیون تومان می&zwnj;باشد.<br />
درصورت پرداخت نقدی، ۱۰٪ از مبلغ کل شهریه کسر خواهد شد.<br />
درصورتی که روش اقساطی مد نظر باشد، ۳۰٪ از مبلغ کل دوره به عنوان پیش پرداخت در ابتدای شروع خدمات تسویه می&zwnj;شود و مابقی مبلغ به روش سیستمی و خودکار در بخش (اقساط شهریه پنل دانش آموز)، به صورت ماهانه تقسیط می&zwnj;شود.</p>
',
                'category_id' => 1,
                'p_code' => 'SDFR-37698',
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 15:02:47',
                'updated_at' => '2025-08-17 18:39:15',
            ),
        ));
        
        
    }
}