<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class SeoItemsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('seo_items')->delete();
        
        \DB::table('seo_items')->insert(array (
            0 => 
            array (
                'id' => 1,
                'slug' => 'سکوی-پرتاب',
                'meta_title' => 'سکوی-پرتاب',
                'meta_description' => '      این پکیج برای آن دسته از افرادی است که به دنبال یک شروع هوشمندانه هستند. فرصتی برای آشنایی با خدمات ما و تست متد SDFR تا از کیفیت و اثربخشی آن اطمینان حاصل کنند.',
                'ref_id' => 1,
                'deleted_at' => '2025-08-12 14:48:30',
                'created_at' => '2025-03-27 21:49:41',
                'updated_at' => '2025-08-12 14:48:30',
            ),
            1 => 
            array (
                'id' => 2,
                'slug' => 'توسعه-و-گستردگی-در-یادگیری',
                'meta_title' => 'توسعه و گستردگی در یادگیری',
                'meta_description' => ' با این پکیج وارد مرحله‌ای پیشرفته‌تر می‌شوید. مشاوره تخصصی با متد انحصاری SDFR، دوره‌های روانشناسی و برنامه‌های ورزشی حرفه‌ای، شما را در مسیری قرار می‌دهد که نه‌تنها در تحصیل، بلکه در جنبه‌های مختلف زندگی نیز پیشرفت کنید.

',
                'ref_id' => 2,
                'deleted_at' => '2025-08-12 14:50:01',
                'created_at' => '2025-03-27 23:27:16',
                'updated_at' => '2025-08-12 14:50:01',
            ),
            2 => 
            array (
                'id' => 3,
                'slug' => 'کوانتوم',
                'meta_title' => 'کوانتوم',
                'meta_description' => ' با این پکیج وارد مرحله‌ای پیشرفته‌تر می‌شوید. مشاوره تخصصی با متد انحصاری SDFR، دوره‌های روانشناسی و برنامه‌های ورزشی حرفه‌ای، شما را در مسیری قرار می‌دهد که نه‌تنها در تحصیل، بلکه در جنبه‌های مختلف زندگی نیز پیشرفت کنید.

',
                'ref_id' => 3,
                'deleted_at' => '2025-08-12 14:50:12',
                'created_at' => '2025-03-27 23:30:09',
                'updated_at' => '2025-08-12 14:50:12',
            ),
            3 => 
            array (
                'id' => 4,
                'slug' => 'دوره-کاوشگر',
                'meta_title' => 'در این دوره دانش آموزان می‌توانند با پرداخت مبلغ ۱8۰ هزار تومان، ۱ هفته به صورت آزمایشی از کلیه خدمات پنل استفاده کنند. همچنین در ابتدای هفته با برنامه ریزی درسی مشاورین مجرب SDFR و پیگیری و پشتیبانی آنها از کیفیت خدمات این سیستم می‌توانند بهره مند شوند.',
                'meta_description' => 'در این دوره دانش آموزان می‌توانند با پرداخت مبلغ ۱8۰ هزار تومان، ۱ هفته به صورت آزمایشی از کلیه خدمات پنل استفاده کنند.
همچنین در ابتدای هفته با برنامه ریزی درسی مشاورین مجرب SDFR و پیگیری و پشتیبانی آنها از کیفیت خدمات این سیستم می‌توانند بهره مند شوند.




',
                'ref_id' => 4,
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:54:18',
                'updated_at' => '2025-08-17 18:10:59',
            ),
            4 => 
            array (
                'id' => 5,
                'slug' => 'دوره-ویگا',
            'meta_title' => 'دوره ویگا (خدمات پشتیبانی تحصیلی)',
                'meta_description' => 'این دوره مخصوص دانش آموزان مستقل برنامه ریزی شده که نیازی به مشاوره تحصیلی ندارند ولی درنظر دارند برای افزایش راندمان مطالعه و پیمودن مسیر صحیح مطالعه از شخص متخصص کمک بگیرند تا با راهنمایی ایشان بتوانند به خروجی بسیار مفیدی از مطالعه خود دست یابند. 
دانش آموزان با انتخاب این دوره تحت نظر پشتیبان تحصیلی به صورت کاملا اختصاصی می توانند از خدمات این دوره بهره مند شوند.

',
                'ref_id' => 5,
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:56:40',
                'updated_at' => '2025-08-17 18:17:01',
            ),
            5 => 
            array (
                'id' => 6,
                'slug' => 'دوره-نوا',
            'meta_title' => 'دوره نوا (خدمات مشاوره و پشتیبانی تحصیلی)',
            'meta_description' => '                               ین دوره مخصوص دانش آموزانی برنامه ریزی شده که علاوه بر راهنمایی و پیگیری درسی (توسط پشتیبان تحصیلی)٫ نیازمند برنامه مطالعاتی هستند تا بتوانند به کمک آن از روی هم جمع شدن دروس و شب امتحانی فشرده خواندن درس ها جلوگیری کنند.
این دوره با برنامه شخصی سازی شده (منطبق با تمامی برنامه های متفرقه و غیرمتفرقه دانش آموز) به صورت هفتگی تمرکز بر روش مطالعه دانش آموز دارد.
یکی از دلایلی که اسم این دوره VIP درنظر گرفته شده این است که دانش آموزان با گذراندن این دوره میتوانند با ساعت مطالعه کم، بیشترین بازدهی را دریافت کنند زیرا صفر تا صد اصول حرفه ای درس خواندن در طول دوره توسط پشتیبان و مشاور مجرب به دانش آموز آموزش داده می‌شود و در برنامه ایشان لحاظ می‌شود.

',
                'ref_id' => 6,
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 14:58:44',
                'updated_at' => '2025-08-17 18:29:57',
            ),
            6 => 
            array (
                'id' => 7,
                'slug' => 'دوره-نبولا-حضوری',
            'meta_title' => 'دوره نبولا (مشاوره تخصصی با مبدع متد برنامه ریزی SDFR (مهندس اتقیایی))',
                'meta_description' => 'این ۲ دوره مخصوص دانش آموزانی درنظر گرفته شده که قصد رسیدن به اهداف دور از انتظار خود را دارند.
درمورد دوره ای صحبت میکنیم که صفر و صد برنامه ریزی شده. این یعنی یا دانش آموز عضو این دوره نمی‌شود یا اگر عضو این دوره شد، هیچ راهی جز قبولی در رشته و دانشگاه دلخواه نداشته باشد!
این دوره به دلیل ارائه خدمات فوق ویژه، فقط تعداد محدود دانش آموز (در یک بازه زمانی خاص از سال تحصیلی) پذیرش دارد.


',
                'ref_id' => 7,
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 15:01:00',
                'updated_at' => '2025-08-17 18:32:27',
            ),
            7 => 
            array (
                'id' => 8,
                'slug' => 'دوره-نبولا-آنلاین',
                'meta_title' => 'دوره نبولا',
                'meta_description' => 'این ۲ دوره مخصوص دانش آموزانی درنظر گرفته شده که قصد رسیدن به اهداف دور از انتظار خود را دارند.
درمورد دوره ای صحبت میکنیم که صفر و صد برنامه ریزی شده. این یعنی یا دانش آموز عضو این دوره نمی‌شود یا اگر عضو این دوره شد، هیچ راهی جز قبولی در رشته و دانشگاه دلخواه نداشته باشد!
این دوره به دلیل ارائه خدمات فوق ویژه، فقط تعداد محدود دانش آموز (در یک بازه زمانی خاص از سال تحصیلی) پذیرش دارد.



',
                'ref_id' => 8,
                'deleted_at' => NULL,
                'created_at' => '2025-08-12 15:02:47',
                'updated_at' => '2025-08-17 18:39:15',
            ),
        ));
        
        
    }
}